Revit 2026 API

# ParameterTypeIdEnergyAnalysisSkylightWidth Property

---

"Skylight Width & Depth"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisSkylightWidth { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisSkylightWidth As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisSkylightWidth {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisSkylightWidth : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace